compressible/dpEqn_Semi-Implicit_Inplace/case/0/gas/dp
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    TOP
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    BOTTOM
    {
        type            zeroGradient;
    }

    FRONT
    {
        type            zeroGradient;
    }

    BACK
    {
        type            zeroGradient;
    }

    LEFT
    {
        type            zeroGradient;
    }

    RIGHT
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
